run/planeXFlowBenchMark/air/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



setFormat       raw;
surfaceFormat   vtk;
//interpolationScheme cellPointFace;
interpolationScheme cell;

fields
(
    T
);

sets
(

    lineX1 
    {
        type            uniform;
        axis            xyz;
        //start           (0.00225 0.03895 0.001016);
        //end             (0.00225 0.03895 0.001905);
        start           (0.00225 0.03895 0.00106045);
        end             (0.00225 0.03895 0.00186055);
	nPoints         10;
    }
);

surfaces
(
    /********
    interpolatedPlane
    {
        type            plane;
        name            ICface;
        basePoint       (0 0 0.00106045);
        normalVector    (0 0 1);
        triangulate     false;
        interpolate     true;
    }
    ********/

    interpolatedPlane
    {
        type            plane;
        name            cathodeA;
        basePoint       (0 0 0.00186055);
        normalVector    (0 0 1);
        triangulate     false;
        interpolate     true;
    }
);


// ************************************************************************* //
